var AppDispatcher = require('../dispatcher/AppDispatcher.jsx');
var EventEmitter = require('events').EventEmitter;
var AppConstants = require('../constants/AppConstants.jsx');
var assign = require('object-assign');

var CHANGE_EVENT = 'change';

var _highlights = 
  {
    "全麻下行左开胸食管癌切除术、弓上吻合术":['感染'],
    "常规抗炎补液抑酸化痰治疗":['感染'],
    "体温正常":['感染'],
    "胸引100mg":['感染'],
    "体温38.0":['感染'],
    "今晨心律120次/分":['感染'],
    
    "高血压病史20年，自服替米沙坦2片QD；糖尿病病史5年，口服二甲双胍tid，格列齐特qd":["心梗"],
    "窦性心律过缓":["心梗"],
    "心律120次/分，诉气促，喘憋。体温38.0，脉搏120次/分，呼吸20次/分，血压120/70mmHg，憋喘貌，双肺呼吸音粗":["心梗"],
    "否认心脏病史":["心梗"],
    "今日下午至夜间心电监测示血压波动于150-200/80-90mmHg，予硝苯地平片舌下含服缓解欠佳":["心梗"],

    "叩诊双侧清音，听诊双侧呼吸正常，湿罗音无，固定，哮鸣音无，胸膜摩擦音无":["肺炎","肺不张"],
    "常规抗炎补液抑酸化痰治疗":["肺炎","肺不张"],
    "诉气促，喘憋。体温38.0，脉搏120次/分，呼吸20次/分，血压120/70mmHg，憋喘貌，双肺呼吸音粗，可闻及广泛哮鸣音":["肺炎","肺不张"],
    "完善床旁胸片":["肺炎","肺不张"],
    "血气分析":["肺炎","肺不张"],

    "高血压病史20年，自服替米沙坦2片QD":["高血压病"],
    "否认心脏病史，否认脑血管疾病":["高血压病"],
    "患者今日下午至夜间心电监测示血压波动于150-200/80-90mmHg，予硝苯地平片舌下含服缓解欠佳，请心内科会诊，测血压为160/86mmHg，心律70次/分，指示患者目前夜间血压高可能与患者睡眠质量较差、精神紧张相关，收缩压高于170mmHg时可予硝苯地平片临时处理，待患者收缩压稳定于160mmHg以下可停心电监护，必要时可予舒乐安定改善睡眠":["高血压病"],
    "血压145/70mmHg":["高血压病","心梗"],
    "注意对症控制血压":["高血压病"],
    "血压120/70mmHg":["高血压病","感染"],

    "糖尿病病史5年，口服二甲双胍tid，格列齐特qd":["糖尿病"],

    "进行性吞咽困难2月，1月前于当地医院进行胃镜检查，提示：“食管喷门癌”。随后就诊于中国科学医学院肿瘤医院，行胸部CT提示：“食管下段癌；纵膈、喷门周围多发淋巴结；右肺上叶炎症？双侧胸膜增厚\",随后行胃镜检查，提示：“食管癌”,上消化道造影提示：“食管胸下段癌”，病理回报：“食管（30-45cm），食管分化差的癌”。未行特殊处理。随后就诊于我院，门诊以食管癌收入院":["吞咽困难","食道恶性肿瘤"],
    "食管喷门占位：患者胃镜发现（食管胸下段）占位病变":["吞咽困难","食道恶性肿瘤"],
    "原发性食管喷门癌：患者老年，男性，胃镜或消化道造影表现，考虑原发性食管喷门癌可能性大；":["吞咽困难","食道恶性肿瘤"],
    "诊断为：食管恶性肿瘤 原治疗计划不变。":["吞咽困难","食道恶性肿瘤"],
    "全麻下行左开胸食管癌切除术、弓上吻合术。手术经过如下：见手术记录。术后诊断：食管恶性肿瘤":["吞咽困难","食道恶性肿瘤"],
    "常规抗炎补液抑酸化":["吞咽困难","食道恶性肿瘤"]
  };


var HighlightStore = assign({}, EventEmitter.prototype, {

  getAll: function() {
    return _highlights;
  },

  emitChange: function() {
    this.emit(CHANGE_EVENT);
  },

  addChangeListener: function(callback) {
    this.on(CHANGE_EVENT, callback);
  },

  removeChangeListener: function(callback) {
    this.removeListener(CHANGE_EVENT, callback);
  }
});

AppDispatcher.register(function(action) {
});

module.exports = HighlightStore;